sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cltcfg.c
/*!
    \file    gd32a7xx_cltcfg.c
    \brief   CLTCFG driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_cltcfg.h"

#define ADC_CH_OFFSET                             (16U)
#define ADC_PIN_MASK                              ((uint32_t)0x0000067EU)
#define CORE_WAIT_OFFSET                          (16U)
#define CORE_WAIT_MASK                            ((uint32_t)0x00060000U)
#define BOOT_ADREESS_OFFSET                       (1U)
#define CLTCFG_LC_MASK                            ((uint32_t)0x00000007U)

/*!
    \brief      get PMU input isolation state
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: RESET or SET
*/
FlagStatus cltcfg_iso_state_get(void)
{
    uint32_t reg;
    FlagStatus state;

    /* get the value of CLTCFG_SR_STAT0 register */
    reg = CLTCFG_SR_STAT0;

    if(0U != (CLTCFG_SR_STAT0_ISO_STAT & reg)) {
        /* input isolation is in active state */
        state = SET;
    }else{
        /* input isolation is in inactive state */
        state = RESET;
    }

    return state;
}

/*!
    \brief      clear PMU input isolation state 
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus cltcfg_iso_state_clear(void)
{
    uint32_t reg;
    ErrStatus state;

    /* get the value of CLTCFG_SR_STAT0 register */
    reg = CLTCFG_SR_STAT0;

    if(0U != (CLTCFG_SR_STAT0_ISO_STAT & reg)) {
        /* write 1 to clear CLTCFG_SR_STAT0_ISO_STAT bit */
        CLTCFG_SR_STAT0 |= CLTCFG_SR_STAT0_ISO_STAT;

        /* get the value of CLTCFG_SR_STAT0 register again */
        reg = CLTCFG_SR_STAT0;
        /* check CLTCFG_SR_STAT0_ISO_STAT is cleared */
        if(0U != (CLTCFG_SR_STAT0_ISO_STAT & reg)) {
            state = ERROR;
        }else{
            state = SUCCESS;
        }
    }else{
        /* PMU input isolation state does not need to be cleared */
        state = SUCCESS;
    }

    return state;
}

/*!
    \brief      get reset pin mode
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: RESET or SET
*/
FlagStatus cltcfg_reset_pin_mode_get(void)
{
    uint32_t reg;
    FlagStatus state;

    /* get the value of CLTCFG_SR_STAT1 register */
    reg = CLTCFG_SR_STAT1;

    if(0U != (CLTCFG_SR_STAT1_RSTPIN_MOD & reg)) {
        /* reset pin acts as dedicated */
        state = SET;
    }else{
        /* reset pin acts as general GPIO pin multiplexed with non-reset function */
        state = RESET;
    }

    return state;
}

/*!
    \brief      get fatal fault IO mode
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: RESET or SET
*/
FlagStatus cltcfg_ffio_mode_get(void)
{
    uint32_t reg;
    FlagStatus state;

    /* get the value of CLTCFG_SR_STAT2 register */
    reg = CLTCFG_SR_STAT2;

    if(0U != (CLTCFG_SR_STAT2_FFIOMOD & reg)) {
        /* FFIO[0] and FFIO[1] acts as dedicated fatal fault reaction pins */
        state = SET;
    }else{
        /* FFIO[0] and FFIO[1] acts as general GPIO pins */
        state = RESET;
    }

    return state;
}

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      get the specified ENET DMA transfer channel state
    \param[in]  channel: ENET DMA channel
                only one parameter can be selected which is shown as below:
      \arg        ENET_CH0: channel 0
      \arg        ENET_CH1: channel 1
    \param[out] none
    \retval     FlagStatus: RESET or SET
*/
FlagStatus cltcfg_enet_ch_state_get(enet_ch_enum channel)
{
    uint32_t reg;
    FlagStatus state = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_CHANNEL(channel)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_SUBSR_STAT0 register */
        reg = CLTCFG_SUBSR_STAT0;

        if(0U != ((uint32_t)channel & reg)) {
            state = SET;
        }else {
            state = RESET;
        }
    }

    return state;
}

/*!
    \brief      clear the specified ENET DMA transfer channel state
    \param[in]  channel: ENET DMA channel
                only one parameter can be selected which is shown as below:
      \arg        ENET_CH0: channel 0
      \arg        ENET_CH1: channel 1
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus cltcfg_enet_ch_state_clear(enet_ch_enum channel)
{
    uint32_t reg;
    ErrStatus state = ERROR;

