sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cltcfg.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_CHANNEL(channel)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_SUBSR_STAT0 register */
        reg = CLTCFG_SUBSR_STAT0;

        if(0U != ((uint32_t)channel & reg)) {
            /* write 1 to clear state bit */
            reg = (uint32_t)channel;
            CLTCFG_SUBSR_STAT0 = reg;

            /* read back the value of CLTCFG_SUBSR_STAT0 register */
            reg = CLTCFG_SUBSR_STAT0;
            if(0U != ((uint32_t)channel & reg)) {
                state = ERROR;
            }else{
                state = SUCCESS;
            }
        }else {
            /* no need write clear, cause this bit is already cleared */
            state = SUCCESS;
        }
    }

    return state;
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      get the power watch dog state
    \param[in]  none
    \param[out] none
    \retval     ControlStatus: DISABLE or ENABLE
*/
ControlStatus cltcfg_porwdg_status_get(void)
{
    uint32_t reg;
    ControlStatus state;

    /* get the value of CLTCFG_SUBSR_STAT1 register */
    reg = CLTCFG_SUBSR_STAT1;

    if(0U != (CLTCFG_SUBSR_STAT1_PWDGEN_STAT & reg)) {
        state = ENABLE;
    } else {
        state = DISABLE;
    }

    return state;
}

/*!
    \brief      get the final-step regulator state
    \param[in]  none
    \param[out] none
    \retval     ControlStatus: DISABLE or ENABLE
*/
ControlStatus cltcfg_fs_status_get(void)
{
    uint32_t reg;
    ControlStatus state;

    /* get the value of CLTCFG_SUBSR_STAT1 register */
    reg = CLTCFG_SUBSR_STAT1;

    if(0U != (CLTCFG_SUBSR_STAT1_FSRDIS_STAT & reg)) {
        state = DISABLE;
    } else {
        state = ENABLE;
    }

    return state;
}

/*!
    \brief      get the system reset upgrade state
    \param[in]  sysrst_ug: system reset resource of upgrade function
                only one parameter can be selected which is shown as below:
      \arg        FMU_REA_FAIL_UPGRADE   : the upgrade function of FMU_REA_FAIL reset
      \arg        STCM_REC_FAIL_UPGRADE  : the upgrade function of STCM_REC_FAIL reset
      \arg        RCTL_SBSRU_UPGRADE     : the upgrade function of RCTL_SBSRU reset
      \arg        LOHRST_UPGRADE         : the upgrade function of LOHRST reset
      \arg        LOPRST_UPGRADE         : the upgrade function of LOPRST reset
      \arg        HSM_SYS_RST_UPGRADE    : the upgrade function of HSM_SYS_RST reset
      \arg        SW_SYS_RST_UPGRADE     : the upgrade function of SW_SYS_RST reset
      \arg        DBG_SYS_RST_UPGRADE    : the upgrade function of DBG_SYS_RST reset
    \param[out] none
    \retval     FlagStatus: RESET or SET
*/
FlagStatus cltcfg_sysrst_upgrade_get(srug_enum sysrst_ug)
{
    uint32_t reg;
    uint32_t temp_0;
    uint32_t temp_1;
    FlagStatus state = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SRUG_RESOURCE(sysrst_ug)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_SUBSR_STAT1 register */
        temp_0 = (CLTCFG_SUBSR_STAT1 & CLTCFG_SUBSR_STAT1_SRUG);
        /* get the value of CLTCFG_SUBSR_STAT2 register */
        temp_1 = (CLTCFG_SUBSR_STAT2 & CLTCFG_SUBSR_STAT2_SRUG);

        reg = (temp_0 | temp_1);
        if(0U != (((uint32_t)sysrst_ug) & reg)) {
            state = SET;
        } else {
            state = RESET;
        }
    }

    return state;
}

/*!
    \brief      configure the clock out function availability
    \param[in]  config: clock out configuration
                only one parameter can be selected which is shown as below:
      \arg        CKOUT1_NOT_AVAILABLE   : The CKOUT1 function is not available while system reset or subsystem reset on PM4
      \arg        CKOUT1_AVAILABLE       : The CKOUT1 function is available while system reset or subsystem reset on PM4
    \param[out] none
    \retval     none
*/
void cltcfg_ckout_standby_config(ckout_valid_enum config)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CKOUT_CONFIG(config)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_POR_CTL0 register */
        reg = CLTCFG_POR_CTL0;

        if(CKOUT1_NOT_AVAILABLE == config) {
            reg &= (~CLTCFG_POR_CTL0_CKOUT1_CFG);
            CLTCFG_POR_CTL0 = reg;
        } else {
            reg |= CLTCFG_POR_CTL0_CKOUT1_CFG;
            CLTCFG_POR_CTL0 = reg;
        }
    }
}

/*!
    \brief      enable the the power watchdog monitor
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_porwdg_monitor_enable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_POR_CTL0 register */
    reg = CLTCFG_POR_CTL0;

    /* enable the the power watchdog monitor */
    reg &= (~CLTCFG_POR_CTL0_PWD_MONDIS);
    CLTCFG_POR_CTL0 = reg;
}

/*!
    \brief      disable the the power watchdog monitor
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_porwdg_monitor_disable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_POR_CTL0 register */
    reg = CLTCFG_POR_CTL0;

    /* disable the the power watchdog monitor */
    reg |= CLTCFG_POR_CTL0_PWD_MONDIS;
    CLTCFG_POR_CTL0 = reg;
}

/*!
    \brief      power watchdog timeout value configuration
    \param[in]  porwdg_timeout_enum: timeout value
                only one parameter can be selected which is shown as below:
      \arg      POR_WDG_TIMEOUT_06_25: power watchdog timeout value = 06.25ms
      \arg      POR_WDG_TIMEOUT_12_50: power watchdog timeout value = 12.50ms
      \arg      POR_WDG_TIMEOUT_25_00: power watchdog timeout value = 25.00ms
      \arg      POR_WDG_TIMEOUT_50_00: power watchdog timeout value = 50.00ms
    \param[out] none
    \retval     none
*/
void cltcfg_porwdg_timeout_config(porwdg_timeout_enum timeout)
{
    uint32_t reg;

