sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cltcfg.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TIMEOUT_VALUE(timeout)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_POR_CTL0 register */
        reg = CLTCFG_POR_CTL0;

        /* clear bits[10:9] */
        reg &= (~CLTCFG_POR_CTL0_PWDTO);

        reg |= (uint32_t)timeout;
        CLTCFG_POR_CTL0 = reg;
    }
}

/*!
    \brief      enable the FMU monitor
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_fmu_monitor_enable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_POR_CTL1 register */
    reg = CLTCFG_POR_CTL1;

    reg &= (~CLTCFG_POR_CTL1_FMU_MONDIS);
    CLTCFG_POR_CTL1 = reg;
}

/*!
    \brief      disable the FMU monitor
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_fmu_monitor_disable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_POR_CTL1 register */
    reg = CLTCFG_POR_CTL1;

    reg |= CLTCFG_POR_CTL1_FMU_MONDIS;
    CLTCFG_POR_CTL1 = reg;
}

/*!
    \brief      configure whether to generate an interrupt or a reset after PLL loss of lock event occurs
    \param[in]  config: configuration of PLL loss of lock event
                only one parameter can be selected which is shown as below:
      \arg      GENERATE_A_SYS_RST: generate a system reset if PLL loss of lock event occurs
      \arg      GENERATE_AN_INT   : generate an interrupt if PLL loss of lock event occurs
    \param[out] none
    \retval     none
*/
void cltcfg_pll_lol_config(lol_cfg_enum config)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LOL_CONFIG(config)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x0010U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_POR_CTL1 register */
        reg = CLTCFG_POR_CTL1;

        /* clear bit9 */
        reg &= (~CLTCFG_POR_CTL1_LOLINT_CFG);

        reg |= (uint32_t)config;

        CLTCFG_POR_CTL1 = reg;
    }
}

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      enable slow trace over subsystem reset
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_slow_trace_enable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_SR_CTL0 register */
    reg = CLTCFG_SR_CTL0;

    reg |= CLTCFG_SR_CTL0_STOSSREN;

    CLTCFG_SR_CTL0 = reg;
}

/*!
    \brief      disable slow trace over subsystem reset
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_slow_trace_disable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_SR_CTL0 register */
    reg = CLTCFG_SR_CTL0;

    reg &= (~CLTCFG_SR_CTL0_STOSSREN);

    CLTCFG_SR_CTL0 = reg;
}

/*!
    \brief      enable fast trace over subsystem reset
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_fast_trace_enable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_SR_CTL0 register */
    reg = CLTCFG_SR_CTL0;

    reg |= CLTCFG_SR_CTL0_FTOSSREN;

    CLTCFG_SR_CTL0 = reg;
}

/*!
    \brief      disable fast trace over subsystem reset
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_fast_trace_disable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_SR_CTL0 register */
    reg = CLTCFG_SR_CTL0;

    reg &= (~CLTCFG_SR_CTL0_FTOSSREN);

    CLTCFG_SR_CTL0 = reg;
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      configure the fault reaction state during selftest
    \param[in]  state: configuration of the FFIO
                only one parameter can be selected which is shown as below:
      \arg      CHANGE_TO_HIGH_Z_STATE: FFIO will change to high Z during selftest when device is under reset
      \arg      REMAIN_IN_FAULT_STATE : FFIO will remain in fault state during selftest when device is under reset
    \param[out] none
    \retval     none
*/
void cltcfg_fault_reaction_config(ffio_state_enum state)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FFIO_CONFIG(state)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_SR_CTL1 register */
        reg = CLTCFG_SR_CTL1;

        /* clear bit7 */
        reg &= (~CLTCFG_SR_CTL1_FRCFG);

        reg |= (uint32_t)state;

        CLTCFG_SR_CTL1 = reg;
    }
}

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      select the ENET mode
    \param[in]  mode: ENET mode
                only one parameter can be selected which is shown as below:
      \arg      ENET_MII_MODE  : mii mode
      \arg      ENET_RMII_MODE : rmii mode
    \param[out] none
    \retval     none
*/
void cltcfg_enet_mode_select(enet_mode_enum mode)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_MODE(mode)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_SUBSR_CTL0 register */
        reg = CLTCFG_SUBSR_CTL0;

        /* clear bit7 */
        reg &= (~CLTCFG_SUBSR_CTL0_ENET_MODE_SEL);

        reg |= (uint32_t)mode;

        CLTCFG_SUBSR_CTL0 = reg;
    }
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      enable IO retaing function before standy entry
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_io_retain_enable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_SUBSR_CTL0 register */
    reg = CLTCFG_SUBSR_CTL0;

    reg &= (~CLTCFG_SUBSR_CTL0_PAD_RET_CFG);

    CLTCFG_SUBSR_CTL0 = reg;
}

/*!
    \brief      disable IO retaing function after standy exit
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_io_retain_disable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_SUBSR_CTL0 register */
    reg = CLTCFG_SUBSR_CTL0;

    reg |= CLTCFG_SUBSR_CTL0_PAD_RET_CFG;

    CLTCFG_SUBSR_CTL0 = reg;
}

/*!
    \brief      ADC channel pin selection
    \param[in]  pin_sel: select drive pin
                only one parameter can be selected which is shown as below:
      \arg      ADC0_CH8_DP_PC6  : ADC0 CH8 selects the PC6 as drive pin
      \arg      ADC0_CH8_DP_PD13 : ADC0 CH8 selects the PD13 as drive pin

      \arg      ADC0_CH9_DP_PG7  : ADC0 CH9 selects the PG7 as drive pin
      \arg      ADC0_CH9_DP_PD11 : ADC0 CH9 selects the PD11 as drive pin

      \arg      ADC1_CH14_DP_PA15: ADC1 CH14 selects the PA15 as drive pin
      \arg      ADC1_CH14_DP_PJ5 : ADC1 CH14 selects the PJ5 as drive pin

      \arg      ADC1_CH15_DP_PA13: ADC1 CH15 selects the PA13 as drive pin
      \arg      ADC1_CH15_DP_PB11: ADC1 CH15 selects the PB11 as drive pin

      \arg      ADC1_CH22_DP_PG6 : ADC1 CH22 selects the PG6 as drive pin
      \arg      ADC1_CH22_DP_PA9 : ADC1 CH22 selects the PA9 as drive pin

