sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cltcfg.c
      \arg      ADC1_CH23_DP_PG8 : ADC1 CH23 selects the PG8 as drive pin
      \arg      ADC1_CH23_DP_PA11: ADC1 CH23 selects the PA11 as drive pin

      \arg      ADC2_CH8_DP_PL2  : ADC2 CH8 selects the PL2 as drive pin
      \arg      ADC2_CH8_DP_PD13 : ADC2 CH8 selects the PD13 as drive pin
      \note     ADC2_CH8_DP_PL2 and ADC2_CH8_DP_PD13 are only for GD32A714Axx/A72xAxx/A74xAxx devices

      \arg      ADC2_CH9_DP_PC13 : ADC2 CH9 selects the PC13 as drive pin
      \arg      ADC2_CH9_DP_PD11 : ADC2 CH9 selects the PD11 as drive pin
      \note     ADC2_CH9_DP_PC13 and ADC2_CH9_DP_PD11 are only for GD32A714Axx/A72xAxx/A74xAxx devices
    \param[out] none
    \retval     none
*/
void cltcfg_adc_drive_pin_select(drive_pin_enum pin_sel)
{
    uint32_t reg;
    uint32_t adc_ch;
    uint32_t pin;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_DRIVE_PIN(pin_sel)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x0019U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_SUBSR_CTL1 register */
        reg = CLTCFG_SUBSR_CTL1;

        adc_ch = (uint32_t)pin_sel >> ADC_CH_OFFSET;
        pin = (uint32_t)pin_sel & ADC_PIN_MASK;

        /* clear the specified ADC channel drive pin bit  */
        reg &= (~adc_ch);
        /* write drive pin configuration */
        reg |= pin;

        CLTCFG_SUBSR_CTL1 = reg;
    }
}

/*!
    \brief      configure CM7 core wait mode
    \param[in]  config: configuration for CM7 core wait mode
                only one parameter can be selected which is shown as below:
      \arg      CORE_0_WAIT_DIS: disable CM7 core 0 wait mode
      \arg      CORE_0_WAIT_EN:  put CM7 core 0 into wait mode by CPUWAIT

      \arg      CORE_1_WAIT_DIS: disable CM7 core 1 wait mode
      \arg      CORE_1_WAIT_EN:  put CM7 core 1 into wait mode by CPUWAIT
      \note     CORE_1_WAIT_DIS and CORE_1_WAIT_EN are only for GD32A714Axx/A72xAxx/A74xAxx devices
    \param[out] none
    \retval     none
*/
void cltcfg_core_wait_mode_config(wait_mode_enum config)
{
    uint32_t reg;
    uint32_t core;
    uint32_t wait_mode;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_WAIT_MODE_CONFIG(config)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x001AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_SUBSR_CTL1 register */
        reg = CLTCFG_SUBSR_CTL1;

        core = (uint32_t)config & CORE_WAIT_MASK;
        wait_mode = (uint32_t)config << CORE_WAIT_OFFSET;

        /* clear the specified core bit */
        reg &= (~core);
        /* write wait mode configuration */
        reg |= wait_mode;

        CLTCFG_SUBSR_CTL1 = reg;
    }
}

/*!
    \brief      configure boot mode
    \param[in]  mode: boot mode
                only one parameter can be selected which is shown as below:
      \arg      NORMAL_BOOT_MODE: normal boot mode
      \arg      FAST_BOOT_MODE: fast boot mode
    \param[out] none
    \retval     none
*/
void cltcfg_boot_mode_config(boot_mode_enum mode)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BOOT_MODE(mode)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_SUBSR_CTL2 register */
        reg = CLTCFG_SUBSR_CTL2;

        /* clear the boot mode bit and write configuration */
        reg &= (~CLTCFG_SUBSR_CTL2_BTMOD);
        reg |= (uint32_t)mode;

        CLTCFG_SUBSR_CTL2 = reg;
    }
}

/*!
    \brief      configure boot address after exiting from standby
    \param[in]  boot_addr: SBAF application boot address after standby exit
    \param[out] none
    \retval     none
*/
void cltcfg_boot_address_config(uint32_t boot_addr)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FAST_BOOT_ADDR(boot_addr)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x001CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = (uint32_t)(boot_addr << BOOT_ADREESS_OFFSET);

        CLTCFG_SUBSR_CTL2 = reg;
    }
}

/*!
    \brief      enable the triple modular redundancy function of specified modul
    \param[in]  modul: the specified modul
                only one parameter can be selected which is shown as below:
      \arg      TMR_GPIO        : gpio tmr
      \arg      TMR_SYSTEM_RESET: system reset tmr
      \arg      TMR_BOOT_MODE   : boot mode tmr
      \arg      TMR_WAIT_MODE   : wait mode tmr
      \arg      TMR_STANDBY_MODE: standby mode tmr
      \arg      TMR_WATCHDOG    : watchdog tmr
    \param[out] none
    \retval     none
*/
void cltcfg_tmr_enable(tmr_modul_enum modul)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TMR_MODUL(modul)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_TMR_CTL register */
        reg = CLTCFG_TMR_CTL;

        reg |= (uint32_t)modul;

        CLTCFG_TMR_CTL = reg;
    }
}

/*!
    \brief      disable the triple modular redundancy function of specified modul
    \param[in]  modul: the specified modul
                only one parameter can be selected which is shown as below:
      \arg      TMR_GPIO        : gpio tmr
      \arg      TMR_SYSTEM_RESET: system reset tmr
      \arg      TMR_BOOT_MODE   : boot mode tmr
      \arg      TMR_WAIT_MODE   : wait mode tmr
      \arg      TMR_STANDBY_MODE: standby mode tmr
      \arg      TMR_WATCHDOG    : watchdog tmr
    \param[out] none
    \retval     none
*/
void cltcfg_tmr_disable(tmr_modul_enum modul)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TMR_MODUL(modul)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_TMR_CTL register */
        reg = CLTCFG_TMR_CTL;

        reg &= ~((uint32_t)modul);

        CLTCFG_TMR_CTL = reg;
    }
}

/*!
    \brief      get the triple modular redundancy error flag of specified modul
    \param[in]  err_flag: the tmr error flag
                only one parameter can be selected which is shown as below:
      \arg      TMR_FLAG_IOTMRERR: gpio tmr error flag
      \arg      TMR_FLAG_SRTMRERR: system reset tmr error flag
      \arg      TMR_FLAG_BTTMRERR: boot mode tmr error flag
      \arg      TMR_FLAG_WMTMRERR: wait mode tmr error flag
      \arg      TMR_FLAG_SBTMRERR: standby mode tmr error flag
      \arg      TMR_FLAG_WDTMRERR: watchdog tmr error flag
    \param[out] none
    \retval     FlagStatus: RESET or SET
*/
FlagStatus cltcfg_tmr_error_flag_get(tmr_err_enum err_flag)
{
    uint32_t reg;
    FlagStatus state = RESET;

