sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cltcfg.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TMR_ERR_FLAG(err_flag)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x001FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of CLTCFG_TMR_STAT register */
        reg = CLTCFG_TMR_STAT;

        if(0U != (reg & (uint32_t)err_flag)) {
            state = SET;
        } else {
            state = RESET;
        }
    }

    return state;
}

/*!
    \brief      clear the triple modular redundancy error flag of specified modul
    \param[in]  err_flag: the tmr error flag
                only one parameter can be selected which is shown as below:
      \arg      TMR_FLAG_IOTMRERR: gpio tmr error flag
      \arg      TMR_FLAG_SRTMRERR: system reset tmr error flag
      \arg      TMR_FLAG_BTTMRERR: boot mode tmr error flag
      \arg      TMR_FLAG_WMTMRERR: wait mode tmr error flag
      \arg      TMR_FLAG_SBTMRERR: standby mode tmr error flag
      \arg      TMR_FLAG_WDTMRERR: watchdog tmr error flag
    \param[out] none
    \retval     none
*/
void cltcfg_tmr_error_flag_clear(tmr_err_enum err_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TMR_ERR_FLAG(err_flag)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear the specified error flag */
        CLTCFG_TMR_FC = (uint32_t)err_flag;
    }
}

/*!
    \brief      get current chip life cycle
    \param[in]  none
    \param[out] none
    \retval     lc_enum: life cycle state
      \arg        LC_FA               : failure analysis
      \arg        LC_UNKNOWN_STATE    : unknown life cycle state
      \arg        LC_OEM_PRODUCTION   : OEM production
      \arg        LC_CUSTOMER_DELIVERY: customer delivery
      \arg        LC_GD_PRODUCTION    : GD production
      \arg        LC_IN_FIELD         : in field
*/
lc_enum cltcfg_current_lc_get(void)
{
    uint32_t reg;
    lc_enum lc = LC_UNKNOWN_STATE;

    /* get the value of CLCS fields in CLTCFG_LC_CS register */
    reg = (uint32_t)CLTCFG_LC_CS;
    reg &= CLTCFG_LC_MASK;

    switch(reg) {
    /* the chip current life cycle is FA */
    case LC_FA:
        lc = LC_FA;
        break;
    /* the chip current life cycle is OEM_PRODUCTION */
    case LC_OEM_PRODUCTION:
        lc = LC_OEM_PRODUCTION;
        break;
    /* the chip current life cycle is CUSTOMER_DELIVERY */
    case LC_CUSTOMER_DELIVERY:
        lc = LC_CUSTOMER_DELIVERY;
        break;
    /* the chip current life cycle is GD_PRODUCTION */
    case LC_GD_PRODUCTION:
        lc = LC_GD_PRODUCTION;
        break;
    /* the chip current life cycle is IN_FILED */
    case LC_IN_FIELD:
        lc = LC_IN_FIELD;
        break;
    default:
        break;
    }

    return lc;
}

/*!
    \brief      get real chip life cycle
    \param[in]  none
    \param[out] none
    \retval     lc_enum: life cycle state
      \arg        LC_FA               : failure analysis
      \arg        LC_UNKNOWN_STATE    : unknown life cycle state
      \arg        LC_OEM_PRODUCTION   : OEM production
      \arg        LC_CUSTOMER_DELIVERY: customer delivery
      \arg        LC_GD_PRODUCTION    : GD production
      \arg        LC_IN_FIELD         : in field
*/
lc_enum cltcfg_real_lc_get(void)
{
    uint32_t reg;
    lc_enum lc = LC_UNKNOWN_STATE;

    /* get the value of RLCS fields in CLTCFG_LC_CS register */
    reg = (uint32_t)CLTCFG_LC_CS >> 4;
    reg &= (CLTCFG_LC_MASK);

    switch(reg) {
    /* chip the current life cycle is FA */
    case LC_FA:
        lc = LC_FA;
        break;
    /* chip the current life cycle is OEM_PRODUCTION */
    case LC_OEM_PRODUCTION:
        lc = LC_OEM_PRODUCTION;
        break;
    /* chip the current life cycle is CUSTOMER_DELIVERY */
    case LC_CUSTOMER_DELIVERY:
        lc = LC_CUSTOMER_DELIVERY;
        break;
    /* chip the current life cycle is GD_PRODUCTION */
    case LC_GD_PRODUCTION:
        lc = LC_GD_PRODUCTION;
        break;
    /* chip the current life cycle is IN_FILED */
    case LC_IN_FIELD:
        lc = LC_IN_FIELD;
        break;
    default:
        break;
    }

    return lc;
}

/*!
    \brief      enable force life cycle
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_force_lc_enable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_LC_CS register */
    reg = CLTCFG_LC_CS;

    reg |= CLTCFG_LC_CS_FLCEN;

    CLTCFG_LC_CS = reg;
}

/*!
    \brief      disable force life cycle
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cltcfg_force_lc_disable(void)
{
    uint32_t reg;

    /* get the value of CLTCFG_LC_CS register */
    reg = CLTCFG_LC_CS;

    reg &= (~CLTCFG_LC_CS_FLCEN);

    CLTCFG_LC_CS = reg;
}

/*!
    \brief      provide provisions for a temporary life cycle update
    \param[in]  update_step: update step number
      \arg      LC_TEMP_NO_FORCE_UPDATE: no force update
      \arg      LC_TEMP_UPDATE_NEXT_ONE: force LC to one next step
      \arg      LC_TEMP_UPDATE_NEXT_TWO: force LC to two next steps
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus cltcfg_temporary_lc_config(lc_update_step_enum update_step)
{
    lc_enum lc;
    ErrStatus state = ERROR;
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_UPDATE_STEP_NUM(update_step)) {
        fw_debug_report_err(CLTCFG_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the real life cycle */
        lc = cltcfg_real_lc_get();
        /* get and clear the value of FTNLCS bits fields in the CLTCFG_LC_CS register */
        reg = CLTCFG_LC_CS;
        reg &= (~CLTCFG_LC_CS_FTNLCS);

        switch(lc) {
        /* chip the current life cycle is FA */
        case LC_FA:
            /* not allowed to move LC in FA */
            state = ERROR;
            break;
        /* chip the current life cycle is OEM_PRODUCTION */
        case LC_OEM_PRODUCTION:
            if(update_step < LC_TEMP_UPDATE_NEXT_TWO) {
                reg |= (uint32_t)update_step;
                CLTCFG_LC_CS = reg;
                state = SUCCESS;
            } else {
                /* two steps update is not allowed */
                state = ERROR;
            }
            break;
        /* chip the current life cycle is CUSTOMER_DELIVERY */
        case LC_CUSTOMER_DELIVERY:
            reg |= (uint32_t)update_step;
            CLTCFG_LC_CS = reg;
            state = SUCCESS;
            break;
        /* chip the current life cycle is GD_PRODUCTION */
        case LC_GD_PRODUCTION:
            if(update_step < LC_TEMP_UPDATE_NEXT_TWO) {
                reg |= (uint32_t)update_step;
                CLTCFG_LC_CS = reg;
                state = SUCCESS;
            } else {
                /* two steps update is not allowed */
                state = ERROR;
            }
            break;
        /* chip the current life cycle is IN_FILED */
        case LC_IN_FIELD:
            /* not allowed to move LC in IN_FIELD */
            state = ERROR;
            break;
        default:
            break;
        }
    }

    return state;
}
